Repository: bakstag147/Time-Hacker-Ideal
Catalog: Time Hacker/Localizable.xcstrings
Source language: en
Languages: ru

# ABOUT_DESCRIPTION_TEXT
source: Time Hacker is a game about social engineering and the art of persuasion. Travel through different eras using communication skills to achieve your goals.
ru: Time Hacker - это игра о социальной инженерии и искусстве убеждения. Путешествуйте через разные эпохи, используя навыки коммуникации для достижения своих целей.

# ABOUT_DESCRIPTION_TITLE
source: Description
ru: Описание

# ABOUT_DEVELOPERS
source: Developers
ru: Разработчики

# ABOUT_DEVELOPERS_TEXT
source: Created with ❤️ for all history and social engineering enthusiasts
ru: Создано с ❤️ для всех любителей истории и социальной инженерии

source: About Game
ru: Об игре

# ABOUT_HOW_TO_PLAY
source: How to Play
ru: Как играть

# ABOUT_HOW_TO_PLAY_TEXT
source: • Each level is a dialogue with a character from a specific era • Use persuasion, knowledge, and wit to achieve your goal • Carefully read the situation description and character reactions • Win by finding the right approach to each conversation partner
ru: • Каждый уровень представляет собой диалог с персонажем из определенной эпохи • Используйте убеждение, знания и хитрость, чтобы достичь цели • Внимательно читайте описание ситуации и реакции персонажа • Победите, найдя правильный подход к каждому собеседнику

# ABOUT_TITLE
source: About Time Hacker
ru: О Time Hacker

source: Best Time
ru: Лучшее время

source: Cancel
ru: Отмена

source: Characters Typed
ru: Символов набрано

source: Close
ru: Закрыть

source: Completion Date
ru: Дата прохождения

source: Current Session
ru: Текущая сессия

source: Enter message...
ru: Введите сообщение...

# ERA_CHINA
source: Medieval China
ru: Средневековый Китай

# ERA_DAWN
source: Dawn of Humanity
ru: Заря Человечества

# ERA_EGYPT
source: Ancient Egypt
ru: Древний Египет

# ERA_ENLIGHTENMENT
source: Age of Enlightenment
ru: Эпоха Просвещения

# ERA_GREECE
source: Ancient Greece
ru: Древняя Греция

# ERA_INDUSTRIAL
source: Industrial Age
ru: Индустриальная Эпоха

# ERA_MEDIEVAL
source: Medieval Europe
ru: Средневековая Европа

# ERA_MODERN
source: Modern Era
ru: Современность

# ERA_RENAISSANCE
source: Renaissance
ru: Эпоха Возрождения

# ERA_ROME
source: Roman Empire
ru: Римская Империя

source: Error
ru: Ошибка

# INVALID_RESPONSE
source: Invalid server response
ru: Неверный ответ от сервера

# LEVEL
source: Level %d
ru: Уровень %d

# LEVEL_COMPLETE
source: Level completed!
ru: Уровень пройден!

# LEVEL_COMPLETE_MESSAGE
source: Congratulations! You've successfully completed level %d!
ru: Поздравляем! Вы успешно прошли уровень %d!

# LEVEL_LOAD_ERROR
source: Error loading level
ru: Ошибка загрузки уровня

# LEVEL_SELECT_TITLE
source: Select Level
ru: Выбор уровня

# LEVEL_VICTORY
source: Congratulations! You've successfully completed level %d!
ru: Поздравляем! Вы успешно прошли уровень %d!

# NETWORK_ERROR
source: Network error. Check your internet connection.
ru: Ошибка сети. Проверьте подключение к интернету.

source: Next Level
ru: Следующий уровень

# OF
source: of %d
ru: из %d

# REPUTATION
source: Reputation %@%d
ru: Репутация %@%d

# REPUTATION_CHANGE
source: Reputation %@%d
ru: Репутация %@%d

# REPUTATION_FRIENDLY
source: Friendly
ru: Дружелюбный

# REPUTATION_HOSTILE
source: Hostile
ru: Враждебный

# REPUTATION_NEUTRAL
source: Neutral
ru: Нейтральный

# REPUTATION_SUSPICIOUS
source: Suspicious
ru: Подозрительный

# REPUTATION_TRUSTING
source: Trusting
ru: Доверяющий

source: Reset
ru: Сбросить

source: Reset Progress
ru: Сбросить прогресс

# RESET_PROGRESS_MESSAGE
source: All levels except the first one will be locked. Completion statistics will be preserved.
ru: Все уровни, кроме первого, будут заблокированы. Статистика прохождения сохранится.

# RESET_PROGRESS_TITLE
source: Reset Progress?
ru: Сбросить прогресс?

source: Select Level
ru: Выбрать уровень

# SERVICE_OVERLOADED
source: Service is overloaded. Please try again later.
ru: Сервис перегружен. Попробуйте позже.

# SHARE_BEST_RESULTS
source: My Best Results
ru: Мои лучшие результаты

source: Share Results
ru: Поделиться результатами

# SHARE_TITLE
source: Time Hacker - Game Results
ru: Time Hacker - Результаты игры

# SHARE_TOTAL_CHARS
source: Total Characters
ru: Всего символов

# SHARE_TOTAL_MESSAGES
source: Total Messages
ru: Всего сообщений

# SHARE_TOTAL_TIME
source: Total Time
ru: Общее время

# SHARE_TRY_BETTER
source: Try to beat my score in Time Hacker!
ru: Попробуй побить мой рекорд в Time Hacker!

source: Start Game
ru: Начать игру

source: Start Over
ru: Начать сначала

# START_OVER_CONFIRM
source: Start Over
ru: Начать

# START_OVER_MESSAGE
source: Are you sure you want to start over? All progress will be lost.
ru: Вы уверены, что хотите начать игру сначала? Весь прогресс будет потерян.

# START_OVER_TITLE
source: Start Over?
ru: Начать сначала?

source: Statistics
ru: Статистика

# STATISTICS_BEST_TIMES
source: Best Times
ru: Лучшее время

# STATISTICS_GENERAL
source: General Statistics
ru: Общая статистика

# STATISTICS_MESSAGES
source: Messages
ru: Сообщений

# STATISTICS_TIME
source: Time
ru: Время

# STATISTICS_TITLE
source: Game Statistics
ru: Статистика игры

source: Total Messages
ru: Всего сообщений

source: Total Time
ru: Общее время

source: Unknown error: %@
ru: Неизвестная ошибка: %@
